---
kind: method
id: M:Autodesk.Revit.DB.FabricationConfiguration.GetAllPartCustomData
source: html/19f74ecb-a0c6-5541-126d-9191b9b6db4a.htm
---
# Autodesk.Revit.DB.FabricationConfiguration.GetAllPartCustomData Method

Gets all possible fabrication part custom data identifiers.

## Syntax (C#)
```csharp
public IList<int> GetAllPartCustomData()
```

## Returns
An array of custom data identifiers.